date: 2021/06/07
detection:
  selection:
    EventID: '10'
    Source_Image|contains:
      wsmprovhost
    condition: selection
    level: high
    author: tus
    description: Detects remote invocation of  powershell.
    falsepositives:
      - Low
    title: Remote Login
    logsource:
      product: windows
      service: sysmon
      category: process_access
    tags:
      - attack.process_injection
      - attack.t1055
