date: 2021/06/07
detection:
  selection:
    EventID: '10'
    Source_Image|contains:
      powershell
    Target_Image| contains:
      lsaas.exe
    condition: selection
    level: high
    author: tus
    description: Detects lsass injection.
    falsepositives:
      - Low
    title: Crdential Dumping
    logsource:
      product: windows
      service: sysmon
      category: process_access
    tags:
      - attack.process_injection
      - attack.t1055.001
