date: 2021/06/07
detection:
  selection:
    EventID: '11'
    Source_Image|contains:
      net.exe
    Command_Line|contains:
      "Shared Folder"
    condition: selection
    level: high
    author: tus
    description: Detects shared folder creation.
    id: spearphishing
    falsepositives:
      - Low
    title: Detects creating shared folder
    logsource:
      product: windows
      service: sysmon
      category: file_creation
    tags:
      - attack.discover
      - attack.t1135
